//DEPRJCL  JOB  1,NOTIFY=UNTG0221
//COBOL1   EXEC COBOLCL,SRC=DATESUB,SRCLIB=CBLSUBS
//COBOL2   EXEC COBOLCL,SRC=DEPRESUB,SRCLIB=CBLSUBS
//COBOL3   EXEC COBOLCL,SRC=DEPRMAIN,SRCLIB=COBOLPGM
//LKED.SYSIN DD *
  INCLUDE SYSLIB(DEPRESUB)
  INCLUDE SYSLIB(DATESUB)
//  IF RC = 0 THEN
//COBOL4   EXEC PGM=DEPRMAIN
//STEPLIB     DD DSN=UNTG022.LOAD,DISP=SHR
//SYSOUT      DD SYSOUT=*
//SYSPRINT    DD SYSOUT=*
//INRECS      DD DSN=UNTG022.COBOLIN(ASSETDAT),DISP=SHR
//OUTRECS     DD DSN=UNTG022.COBOLOUT(ASSOUT),DISP=SHR
//  ENDIF
//
