//EMPJCL   JOB  1,NOTIFY=UNTG022
//COBOL1   EXEC COBOLCL,SRC=HOLDDATE,SRCLIB=CBLSUBS
//COBOL2   EXEC COBOLCL,SRC=FICATEST,SRCLIB=CBLSUBS
//COBOL3   EXEC COBOLCL,SRC=EXMPAMT,SRCLIB=CBLSUBS
//COBOL4   EXEC COBOLCL,SRC=EMPLOYEE,SRCLIB=COBOLPGM
//LKED.SYSIN DD *
  INCLUDE SYSLIB(HOLDDATE)
  INCLUDE SYSLIB(FICATEST)
  INCLUDE SYSLIB(EXMPAMT)
//  IF RC = 0 THEN
//COBOL5   EXEC PGM=EMPLOYEE
//STEPLIB     DD DSN=UNTG022.LOAD,DISP=SHR
//SYSOUT      DD SYSOUT=*
//SYSPRINT    DD SYSOUT=*
//INRECS      DD DSN=UNTG022.COBOLIN(EMPLOYEE),DISP=SHR
//OUTRECS     DD DSN=UNTG022.COBOLOUT(EMPLOYEE),DISP=SHR
//  ENDIF
//